c = str(input())
c2 = str(input())
if c != 'красный' and c != 'синий' and c != 'желтый':
    print('Ошибка')
if c2 != 'красный' and c2 != 'синий' and c2 != 'желтый':
    print('Ошибка')
if (c == 'красный' or c == 'синий' or c == 'желтый') and (c2 == 'красный' or c2 == 'синий' or c2 == 'желтый'):
    if (c == 'красный' and c2 == 'синий') or (c2 == 'красный' and c == 'синий'): print('фиолетовый')
    elif (c == 'красный' and c2 == 'желтый') or (c2 == 'красный' and c == 'желтый'): print('оранжевый')
    elif (c == 'синий' and c2 == 'желтый') or (c2 == 'синий' and c == 'желтый'): print('зеленый')
